1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series

In [1]:
import pandas as pd

In [3]:
l = [4,8,15,16,23,42]
s1 = pd.Series(l)
print(s1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

In [5]:
l = [1,2,3,4,5,6,7,8,"dhruv", "panchal"]
s2 = pd.Series(l)
print(s2)

0          1
1          2
2          3
3          4
4          5
5          6
6          7
7          8
8      dhruv
9    panchal
dtype: object

3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [ ]:
name    age   gender
alice   25    female
bob     30    male
claire  27    female

In [8]:
l = [["alice",25,"female"],
["bob",30,"male"],
["claire",27,"female"]]

In [10]:
data = pd.DataFrame(l, columns=["name","age","gender"])
data

     name  age  gender
0   alice   25  female
1     bob   30    male
2  claire   27  female

4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
In the context of the pandas library in Python, 

a DataFrame is a two-dimensional data structure that represents tabular data,
similar to a spreadsheet or a SQL table. 
It is one of the fundamental data structures provided by pandas for data manipulation and analysis.

A DataFrame consists of rows and columns, where each column can contain different data types. 
It provides powerful indexing and data alignment features, making it easy to perform operations on data,
such as filtering, sorting, grouping, and aggregating.

On the other hand, a pandas Series is a one-dimensional labeled array that can hold data of any type.
It is similar to a column in a DataFrame or a single column of data in a spreadsheet. 
A Series has a single column of data and an associated index that uniquely identifies each element in the Series.

In [5]:
#  Ex :
s1 = pd.Series([1,2,3,4,5,6])
print(s1)
print(type(s1))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [12]:
#  Ex:

# data = [[1,2,3],[2,3,4],[3,4,5]]
data = {
    "name":["dhruv" , "panchal" , "pravin"],
    "age" :[20,21,25],
    "city":['New York', 'London', 'Paris']
}
data1 = pd.DataFrame(data)
data1

      name  age      city
0    dhruv   20  New York
1  panchal   21    London
2   pravin   25     Paris

In [13]:
print(type(data1))
print(data1['name'])
print(type(data1['name']))

<class 'pandas.core.frame.DataFrame'>
0      dhruv
1    panchal
2     pravin
Name: name, dtype: object
<class 'pandas.core.series.Series'>

5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

Pandas provides a wide range of functions and methods for data manipulation in a DataFrame.
Here are some common functions you can use to manipulate data in a Pandas DataFrame:

1.head() and tail(): These functions allow you to retrieve the first few rows (`head()`) or t
    he last few rows (`tail()`) of a DataFrame. 
    They are useful for quickly inspecting the structure and contents of the DataFrame.

2.info(): The `info()` function provides a summary of the DataFrame,
    including the number of rows and columns, data types of each column, and memory usage. 
    It helps in understanding the overall structure of the DataFrame.

3.describe(): This function generates descriptive statistics of the DataFrame,
    including count, mean, standard deviation, minimum, maximum, and quartile values. 
    It provides insights into the distribution and summary statistics of numerical columns.

4.sort_values(): This function allows you to sort the DataFrame based on one or more columns. 
    You can specify the column(s) to sort by and the sorting order (ascending or descending). 
    Sorting is useful when you want to arrange the data in a specific order for analysis or presentation.

5.groupby(): The `groupby()` function enables you to group the data in the DataFrame based on one or more columns. 
    It is often used in combination with aggregation functions like `sum()`, `mean()`, `count()`, etc., to calculate summary statistics for each group. Grouping is useful for performing analysis on specific subsets of data.

6.filter(): This function allows you to filter the DataFrame based on specific conditions. 
    You can define a Boolean expression to filter rows that meet certain criteria. 
    Filtering is useful when you want to extract specific subsets of data that satisfy certain conditions.

7.fillna(): The `fillna()` function is used to fill missing or NaN (null) values in the DataFrame with 
    a specified value or a calculated value such as the mean or median. 
    It helps in handling missing data and preparing the DataFrame for further analysis.

8.apply(): This function applies a function to each element or column of the DataFrame. 
    It is useful for performing custom transformations or calculations on the data. 
    You can use built-in functions or define your own custom functions to apply to the DataFrame.

In [14]:
data = {
    "name":["dhruv" , "panchal" , "pravin"],
    "age" :[20,21,25],
    "city":['New York', 'London', 'Paris']
}
d1 = pd.DataFrame(data)
d1

      name  age      city
0    dhruv   20  New York
1  panchal   21    London
2   pravin   25     Paris

In [23]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [16]:
d1.describe()

             age
count   3.000000
mean   22.000000
std     2.645751
min    20.000000
25%    20.500000
50%    21.000000
75%    23.000000
max    25.000000

In [17]:
d1.describe(include='all')

         name        age      city
count       3   3.000000         3
unique      3        NaN         3
top     dhruv        NaN  New York
freq        1        NaN         1
mean      NaN  22.000000       NaN
std       NaN   2.645751       NaN
min       NaN  20.000000       NaN
25%       NaN  20.500000       NaN
50%       NaN  21.000000       NaN
75%       NaN  23.000000       NaN
max       NaN  25.000000       NaN

In [19]:
d1.head()

      name  age      city
0    dhruv   20  New York
1  panchal   21    London
2   pravin   25     Paris

In [20]:
d1.tail()

      name  age      city
0    dhruv   20  New York
1  panchal   21    London
2   pravin   25     Paris

In [22]:
d1.sort_values(by='city')

      name  age      city
1  panchal   21    London
0    dhruv   20  New York
2   pravin   25     Paris

6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
In the pandas library, which is commonly used for data manipulation and analysis in Python, 
both Series and DataFrame are mutable, while Panel is not.

A Series in pandas is a one-dimensional array-like object that can hold any data type.
You can modify its elements by assigning new values to specific positions or by using methods such as loc 
to change specific values.

Similarly, a DataFrame in pandas is a two-dimensional labeled data structure with columns of potentially different data types.
You can modify its contents by assigning new values to specific cells, columns, or rows using methods like loc 
by using functions like fillna or replace to modify specific values or fill missing values.

On the other hand, 
Panel is a three-dimensional data structure in pandas that can hold data of different types. 
However, Panel is considered deprecated in recent versions of pandas, and it is recommended to use other 
data structures like DataFrame or multi-indexed DataFrames to represent three-dimensional data. 
Panels were replaced by the more flexible and powerful MultiIndex functionality available in pandas DataFrames.

To summarize, Series and DataFrame are mutable in nature, meaning you can change their values after creation, 
while Panel is not typically used anymore and is not mutable.

In [27]:
# Ex: 

s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [31]:
print(s1[1])
s1[1] = 4

2

In [32]:
print(s1)

0    1
1    4
2    3
3    4
4    5
dtype: int64

In [34]:
data = {
    "id" : [1,2,3,4,5],
    "name" :["Dhruv" , "Panchal" , "chintan","hiten","ved"],
    "age" : [20,21,22,20,21]
}

d1 = pd.DataFrame(data)
d1

   id     name  age
0   1    Dhruv   20
1   2  Panchal   21
2   3  chintan   22
3   4    hiten   20
4   5      ved   21

In [39]:
d1[["age"]] = d1[["age"]].apply(lambda x : x+1)

In [40]:
d1[["age"]]

   age
0   21
1   22
2   23
3   21
4   22

In [41]:
# panel is not mutable

7. Create a DataFrame using multiple Series. Explain with an example.

In [44]:
s1 = [1,2,3,4,5]
s2 = [2,3,4,5,6]
s3 = [5,6,7,8,9]
se1 = pd.Series(s1)
se2 = pd.Series(s2)
se3 = pd.Series(s3)
se1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [46]:
data1 = pd.DataFrame({"c1" : list(se1),
                     "c2" : list(se2),
                     "c3" : list(se3)
                     })

In [47]:
data1

   c1  c2  c3
0   1   2   5
1   2   3   6
2   3   4   7
3   4   5   8
4   5   6   9

In [48]:
d1 =pd.concat([se1,se2,se2],axis=1)

In [49]:
d1

   0  1  2
0  1  2  2
1  2  3  3
2  3  4  4
3  4  5  5
4  5  6  6